
"Messages.UnreadMark" = "Unread messages";
"Messages.ForwardHeader" = "Forwarded messages";
"Messages.File.State.FetchingIn_1" = "%d% downloaded";
"Messages.File.State.FetchingOut_1" = "%d% uploaded";

"Messages.File.State.Remote" = "Download";
"Messages.File.State.Local" = "Show in Finder";
"Messages.DeletedMessage" = "Deleted message";

"Messages.Placeholder.SentMessage" = "Write a message...";
"SearchField.Search" = "Search";
"Contacts.ContacsSeparator" = "Contacts";
"Navigation.back" = "Back";
"Navigation.Edit" = "Edit";
"Navigation.Done" = "Done";
"Navigation.Close" = "Close";
"Navigation.Cancel" = "Cancel";

"Gallery.Counter" = "%d of %d";

"Peer.Status.online" = "online";
"Peer.Status.recently" = "last seen recently";
"Peer.Status.justNow" = "last seen just now";
"Peer.Status.lastWeek" = "last seen within a week";
"Peer.Status.lastMonth" = "last seen within a month";

"Peer.Status.Today" = "today";
"Peer.Status.Yesterday" = "yesterday";
"Peer.Status.LastSeenAt" = "last seen %@ at %@";


/* do not translate key with 'countable' suffix */
"Peer.Status.Member_countable" = "%d";
"Peer.Status.Member_zero" = "%d members";
"Peer.Status.Member_one" = "%d member";
"Peer.Status.Member_two" = "%d members";
"Peer.Status.Member_few" = "%d members";
"Peer.Status.Member_many" = "%d members";
"Peer.Status.Member_other" = "%d members";

/* do not translate key with 'countable' suffix */
"Peer.Status.Member.Online_countable" = "%d";
"Peer.Status.Member.Online_zero" = "%d online";
"Peer.Status.Member.Online_one" = "%d online";
"Peer.Status.Member.Online_two" = "%d online";
"Peer.Status.Member.Online_few" = "%d online";
"Peer.Status.Member.Online_many" = "%d online";
"Peer.Status.Member.Online_other" = "%d online";


/* do not translate key with 'countable' suffix */
"Peer.Status.minAgo_countable" = "%d";
"Peer.Status.minAgo_zero" = "last seen %d minutes ago";
"Peer.Status.minAgo_one" = "last seen %d minute ago";
"Peer.Status.minAgo_two" = "last seen %d minutes ago";
"Peer.Status.minAgo_few" = "last seen %d minutes ago";
"Peer.Status.minAgo_many" = "last seen %d minutes ago";
"Peer.Status.minAgo_other" = "last seen %d minutes ago";

"Peer.Status.channel" = "channel";
"Peer.Status.group" = "group";

"Telegram.PeerInfoController" = "Info";
"PeerInfo.SendMessage" = "Send Message";
"PeerInfo.ShareContact" = "Share Contact";
"PeerInfo.StartSecretChat" = "Start Secret Chat";
"PeerInfo.SharedMedia" = "Shared Media";
"PeerInfo.Notifications" = "Notifications";
"PeerInfo.BlockUser" = "Block User";
"PeerInfo.UnblockUser" = "Unblock User";
"PeerInfo.username" = "username";
"PeerInfo.about" = "about";
"PeerInfo.bio" = "bio";
"PeerInfo.info" = "info";
"PeerInfo.SetGroupPhoto" = "Set Group Photo";
"PeerInfo.AddMember" = "Add member";
"PeerInfo.DeleteAndExit" = "Delete and Exit";
"PeerInfo.LeaveChannel" = "Leave Channel";
"PeerInfo.Report" = "Report";
"PeerInfo.sharelink" = "share link";
"PeerInfo.Confirm.LeaveChannel" = "Are you sure you want to leave this channel?";
"PeerInfo.Confirm.LeaveGroup" = "Are you sure you want to leave this group?\n\nThis action cannot be undone.";
"PeerInfo.Confirm.DeleteChat" = "Are you sure you want to delete all message history and leave \"%@\"?\n\nThis action cannot be undone.";
"Confirm.DeleteAdminedChannel" = "Wait! Deleting this channel will remove all members and all messages will be lost. Delete the channel anyway?";
"Confirm.DeleteChatUser" = "Are you sure you want to delete all message history?\n\nThis action cannot be undone.";
"Confirm.LeaveGroup" = "Are you sure you want to leave this group?";

"PeerMedia.SharedMedia" = "Shared Media";
"EmptyPeer.Description" = "Select a chat to start messaging";

"Emoji.Recent" = "Frequently Used";
"Emoji.SmilesAndPeople" = "Smileys & People";
"Emoji.AnimalsAndNature" = "Animals & Nature";
"Emoji.FoodAndDrink" = "Food & Drink";
"Emoji.ActivityAndSport" = "Activity & Sport";
"Emoji.TravelAndPlaces" = "Travel & Places";
"Emoji.Objects" = "Objects";
"Emoji.Symbols" = "Symbols";
"Emoji.Flags" = "Flags";


"Chat.DropTitle" = "Drop files here to send them";
"Chat.DropQuickDesc" = "in a quick way";
"Chat.DropAsFilesDesc" = "without compression";

"Message.ActionsPanel.Delete" = "Delete";
"Message.ActionsPanel.Forward" = "Forward";
"Message.ActionsPanel.EmptySelected" = "Select messages";


/* do not translate key with 'countable' suffix */
"Message.ActionsPanel.SelectedCount_countable" = "%d";
"Message.ActionsPanel.SelectedCount_zero" = "%d messages selected";
"Message.ActionsPanel.SelectedCount_one" = "%d message selected";
"Message.ActionsPanel.SelectedCount_two" = "%d messages selected";
"Message.ActionsPanel.SelectedCount_few" = "%d messages selected";
"Message.ActionsPanel.SelectedCount_many" = "%d messages selected";
"Message.ActionsPanel.SelectedCount_other" = "%d messages selected";


/* do not translate key with 'countable' suffix */
"Message.AccessoryPanel.Forwarded_countable" = "%d";
"Message.AccessoryPanel.Forwarded_zero" = "%d forwarded messages";
"Message.AccessoryPanel.Forwarded_one" = "%d forwarded message";
"Message.AccessoryPanel.Forwarded_two" = "%d forwarded messages";
"Message.AccessoryPanel.Forwarded_few" = "%d forwarded messages";
"Message.AccessoryPanel.Forwarded_many" = "%d forwarded messages";
"Message.AccessoryPanel.Forwarded_other" = "%d forwarded messages";



/* do not translate key with 'countable' suffix */
"ForwardModalAction.Title_countable" = "%d";
"ForwardModalAction.Title_zero" = "Forwarding messages";
"ForwardModalAction.Title_one" = "Forwarding message";
"ForwardModalAction.Title_two" = "Forwarding messages";
"ForwardModalAction.Title_few" = "Forwarding messages";
"ForwardModalAction.Title_many" = "Forwarding messages";
"ForwardModalAction.Title_other" = "Forwarding messages";


/*
 _zero
 _one
 _two
 _few
 _many
 _other
 */

/* do not translate key with 'countable' suffix */
"ForwardModalAction.description_countable" = "%d %@";
"ForwardModalAction.description_zero" = "Select a user or chat to forward messages from %@";
"ForwardModalAction.description_one" = "Select a user or chat to forward message from %@";
"ForwardModalAction.description_two" = "Select a user or chat to forward messages from %@";
"ForwardModalAction.description_few" = "Select a user or chat to forward messages from %@";
"ForwardModalAction.description_many" = "Select a user or chat to forward messages from %@";
"ForwardModalAction.description_other" = "Select a user or chat to forward messages from %@";


"Alert.OK" = "OK";
"Alert.Cancel" = "Cancel";


"Alert.Forward.Error" = "Can't forward messages to this conversation.";

"PreviewSender.CompressFile" = "Send as compressed";
"PreviewSender.CaptionPlaceholder" = "Add a caption...";
"PreviewSender.CommentPlaceholder" = "Add a comment...";
"PreviewSender.FileTooltip" = "Without compression";
"PreviewSender.MediaTooltip" = "Quick way";

"Modal.Send" = "Send";
"Modal.Share" = "Share";
"Modal.CopyLink" = "Copy Link";
"Modal.Cancel" = "Cancel";
"Modal.OK" = "OK";

"QuickLook.Preview" = "Preview";


"Chat.Service.You" = "You";
"Chat.Service.Group.Created" = "%@ created the group \"%@\"";
"Chat.Service.Group.AddedMembers" = "%@ invited %@";
"Chat.Service.Group.AddedSelf" = "%@ joined group";
"Chat.Service.Group.RemovedMembers" = "%@ kicked %@";
"Chat.Service.Group.RemovedSelf" = "%@ left group";
"Chat.Service.Group.UpdatedPhoto" = "%@ updated group photo";
"Chat.Service.Group.RemovedPhoto" = "%@ removed group photo";
"Chat.Service.Group.UpdatedTitle" = "%@ changed group name to \"%@\"";
"Chat.Service.Group.UpdatedPinnedMessage" = "%@ pinned \"%@\"";
"Chat.Service.Group.JoinedByLink" = "%@ joined group via invite link";
"Chat.Service.Group.MigratedToSupergroup" = "This group was upgraded to a supergroup";
"Chat.Service.Group.TookScreenshot" = "%@ took a screenshot";
"Chat.Service.PinnedMessage" = "pinned message";

"Chat.Service.Channel.UpdatedPhoto" = "channel photo updated";
"Chat.Service.Channel.RemovedPhoto" = "channel photo removed";
"Chat.Service.Channel.UpdatedTitle" = "channel renamed to \"%@\"";


"Chat.Service.SecretChat.SetTimer" = "%@ set the self-destruct timer to %@";
"Chat.Service.SecretChat.SetTimer.Self" = "You set the self-destruct timer to %@";
"Chat.Service.SecretChat.DisabledTimer" = "%@ disabled the self-destruct timer";
"Chat.Service.SecretChat.DisabledTimer.Self" = "You disabled the self-destruct timer";

"Chat.Input.Mute" = "Mute";
"Chat.Input.Unmute" = "Unmute";
"Chat.Input.Return" = "Return to group";
"Chat.Input.SecretChat.WaitingToOnline" = "Waiting for the user to come online...";
"Chat.Input.Delete" = "Delete and exit";
"Chat.Input.Join" = "Join";
"Chat.Input.Unblock" = "Unblock";

"Message.Context.Reply1" = "Reply";
"Message.Context.ReplyHelp" = "double click";

"Message.Context.Forward" = "Forward";
"Message.Context.Delete" = "Delete";
"Message.Context.Select" = "Select";
"Message.Context.Edit" = "Edit";
"Message.Context.Goto" = "Show Message";
"Message.Context.Pin" = "Pin";
"Message.Context.Confirm.Pin" = "Pin this message and notify all members of the group?";
"Message.Context.Confirm.OnlyPin" = "Pin only";
"Message.Context.ForwardToCloud" = "Save to Cloud Storage";

"Entertainment.Switch.GifAndStickers" = "Stickers & GIFs";
"Entertainment.Switch.Emoji" = "Emoji";
"Telegram.LayoutAccountController" = "Settings";

"AccountSettings.SetProfilePhoto" = "Set Profile Photo";
"AccountSettings.General" = "General";
"AccountSettings.Stickers" = "Stickers";
"AccountSettings.Notifications" = "Notifications";
"AccountSettings.Username" = "Username";
"AccountSettings.Language" = "Language";
"AccountSettings.PrivacyAndSecurity" = "Privacy and Security";

"AccountSettings.About" = "About";
"AccountSettings.FAQ" = "Telegram FAQ";
"AccountSettings.AskQuestion" = "Ask a Question";

"ConnectingStatus.connecting" = "connecting";
"ConnectingStatus.online" = "online";
"ConnectingStatus.updating" = "updating";
"ConnectingStatus.waitingNetwork" = "waiting for network";
"ConnectingStatus.connectingToProxy" = "connecting to proxy";

"Chat.ConnectingStatus.connecting" = "Connecting";
"Chat.ConnectingStatus.updating" = "Updating";
"Chat.ConnectingStatus.waitingNetwork" = "Waiting for network";
"Chat.ConnectingStatus.connectingToProxy" = "Connecting to proxy";

"InputAttach.Popover.PhotoOrVideo" = "Photo Or Video";
"InputAttach.Popover.Picture" = "Camera";
"InputAttach.Popover.File" = "File";

"Compose.Popover.NewGroup" = "New Group";
"Compose.Popover.NewChannel" = "New Channel";
"Compose.Popover.NewSecretChat" = "New Secret Chat";


"Chat.Cancel" = "Cancel";
"Gallery.Context.SaveAs" = "Save As...";
"Gallery.Context.ShowMessage" = "Show Message";
"Gallery.Context.CopyToClipboard" = "Copy to Clipboard";
"Gallery.ContextDeletePhoto" = "Delete";

"Chat.Input.Accessory.EditMessage" = "Edit Message";
"Chat.Message.edited" = "edited";

"PeerMedia.Popover.SharedMedia" = "Shared Media";
"PeerMedia.Popover.SharedFiles" = "Shared Files";
"PeerMedia.Popover.SharedLinks" = "Shared Links";
"PeerMedia.Popover.SharedAudio" = "Shared Audio";
"Chat.Message.Via" = "via";

"Audio.UnknownArtist" = "Unknown Artist";
"Audio.UntitledSong" = "Untitled";

"AudioController.voiceMessage" = "voice message";
"AudioController.videoMessage" = "video message";
"You" = "You";


"Login.WelcomeDescription" = "Welcome to the macOS application";
"Login.countryLabel" = "country";
"Login.phoneFieldPlaceholder" = "phone number";
"Login.Next" = "Next";

"Login.InvalidCountryCode" = "Invalid Country Code";
"Login.codePlaceholder" = "code";


"Login.EnterCodeFromApp" = "Please enter the code you've just received in Telegram on your other device.";
"Login.SendSmsIfNotReceivedAppCode" = "Haven't received the code?";
"Login.JustSentSms" = "We have sent you a code via SMS. Please enter it above.";
"Login.PhoneCalledCode" = "We’ve just called your number. Please enter the code above.";
"Login.PhoneDialed" = "Telegram dialed your number";
"Login.willCall" = "Telegram will call you in %d:%@";
"Login.willSendSms" = "Telegram will send you an SMS in %d:%@";
"Login.passwordPlaceholder" = "password";

"Login.EnterPasswordDescription" = "You have enabled Two-Step Verification, your account is now protected with an additional password.";
"Login.RecoveryMailFailed" = "Since you haven't provided a recovery e-mail during the setup of your password, your remaining options are either to remember your password or to reset your account.";

"Login.ResetAccount" = "RESET MY ACCOUNT";
"Login.ResetAccountDescription" = "All your chats and messages, along with any media and files you shared will be lost if you proceed with resetting your account.";
"Login.ResetAccount" = "RESET MY ACCOUNT";

"PHONE_NUMBER_INVALID" = "invalid phone number";
"Login.FloodWait" = "too many attempts, please try later.";
"PHONE_CODE_INVALID" = "phone code invalid";
"PHONE_CODE_EXPIRED" = "code expired";
"PASSWORD_HASH_INVALID" = "incorrect password";



"Chat.ForwardActionHeader" = "Forward Messages";
"AudioRecord.ReleaseOut" = "Release outside of this field to cancel";


"GeneralSettings.LargeFonts" = "Large Message Font";
"GeneralSettings.MediaKeysForInAppPlayer" = "Handle media keys for in-app player";
"GeneralSettings.EmojiReplacements" = "Automatic replace emojis";
"GeneralSettings.InputSettings" = "INPUT SETTINGS";
"GeneralSettings.GeneralSettings" = "GENERAL SETTINGS";

"GeneralSettings.SendByEnter" = "Use Enter to send";
"GeneralSettings.SendByCmdEnter" = "Use ⌘ + Enter to send";

"Telegram.GeneralSettingsViewController" = "General Settings";
"AccountSettings.Logout" = "Logout";
"NotificationSettings.ToggleNotifications" = "Notifications";
"NotificationSettings.MessagesPreview" = "Message Preview";
"NotificationSettings.NotificationTone" = "Notification Tone";
"NotificationSettings.ResetNotifications" = "Reset Notifications";
"NotificationSettings.ResetNotificationsText" = "You can set custom notifications for specific chats below.";
"Telegram.NotificationSettingsViewController" = "Notifications";
"AccountSettings.Storage" = "Storage";
"DefaultSoundName" = "Default";
"NotificationSettings.Tone.Default" = "Default";
"NotificationSettingsToneNone" = "None";

"NotificationSettings.Confirm.Reset" = "Reset notifications";


"Weekday.ShortFriday" = "Fri";
"Weekday.ShortMonday" = "Mon";
"Weekday.ShortSaturday" = "Sat";
"Weekday.ShortSunday" = "Sun";
"Weekday.ShortThursday" = "Thu";
"Weekday.ShortTuesday" = "Tue";
"Weekday.ShortWednesday" = "Wed";


"Time.at" = "at";
"Time.last_seen" = "last seen";
"Time.today" = "today";
"Time.yesterday" = "yesterday";


"Chat.EmptyChat" = "No messages here yet";

"Chat.List.Sticker" = "%@ Sticker";
"Chat.List.Voice" = "Voice message";
"Chat.List.InstantVideo" = "Video message";
"Chat.List.Video" = "Video";
"Chat.List.Photo" = "Photo";
"Chat.List.GIF" = "GIF";
"Chat.List.Map" = "Location";
"Chat.List.Contact" = "Contact";

"UsernameSettings.ChangeDescription" = "You can choose a username on Telegram. If you do, other people will be able to find you by this username and contact you without knowing your phone number.\n\n\nYou can use a-z, 0-9 and underscores. Minimum length is 5 characters.";
"UsernameSettings.InputPlaceholder" = "Enter your username";
"Telegram.UsernameSettingsViewController" = "Username";
"UsernameSettings.available" = "%@ is available";

"Error.Username.UnderscopeStart" = "A username can't start with an underscore.";
"Error.Username.UnderscopeEnd" = "A username can't end with an underscore.";
"Error.Username.NumberStart" = "A username can't start with a number.";
"Error.Username.Invalid" = "This username is invalid.";
"Error.Username.MinimumLength" = "A username must have at least 5 characters.";
"Error.Username.AlreadyTaken" = "This username is already taken.";
"UsernameSettings.Done" = "Done";

"Search.Separator.ChatsAndContacts" = "contacts and chats";
"Search.Separator.GlobalPeers" = "global search";
"Search.Separator.Messages" = "messages";
"Search.Separator.Recent" = "Recent";
"Search.Separator.Popular" = "People";
"PeerInfo.AdminLabel" = "admin";
"Share.Link.Copied" = "Copied to Clipboard";


"Presence.bot" = "bot";
"CreateGroup.NameHolder" = "Group Name";
"Telegram.ChannelIntroViewController" = "Channel";
"Channel.IntroDescriptionHeader" = "What is a Channel?";
"Channel.IntroDescription" = "Channels are a tool for broadcasting your messages to large audiences.";
"Channel.Create" = "Create";
"Channel.NewChannel" = "New Channel";
"Group.CreateGroup" = "New Group";
"Compose.Create" = "Create";
"Compose.Next" = "Next";
"Channel.ChannelNameHolder" = "Channel Name";
"Channel.DescriptionHolder" = "Description";
"Channel.DescriptionHolderDescrpiton" = "You can provide an optional description for your channel.";


"Channel.TypeHeaderChannel" = "CHANNEL TYPE";
"Channel.TypeHeaderGroup" = "GROUP TYPE";


"Channel.Public" = "Public";
"Channel.Private" = "Private";


"Channel.PrivateAboutChannel" = "Private channels can only be joined via an invite link.";
"Channel.PublicAboutChannel" = "Public channels can be found via search, anyone can join them.";
"Channel.PrivateAboutGroup" = "Private groups can only be joined if you were invited or by invite link.";
"Channel.PublicAboutGroup" = "Public groups can be found via search, chat history is available to everyone and anyone can join.";

"Channel.PublicNamesLimitError" = "Sorry, you have reserved too many public usernames. You can revoke the link from one of your older groups or channels, or create a private entity instead";


"Channel.ExportLinkAboutChannel" = "People can join your channel by following this link. You can revoke the link at any time.";
"Channel.ExportLinkAboutGroup" = "People can join your group by following this link. You can revoke the link at any time.";
"Channel.UsernameAboutChannel" = "People can share this link with others and find your channel using Telegram search.";
"Channel.UsernameAboutGroup" = "People can share this link with others and find your group using Telegram search.";


"Group.NewGroup" = "New Group";

"Chat.Confirm.ActionUndonable" = "This action can't be undone";
"Chat.Confirm.DeleteMessages" = "Delete selected messages?";
"Chat.Confirm.DeleteMessagesForEveryone" = "Delete for All";

"Telegram.PrivacyAndSecurityViewController" = "Privacy and Security";
"PrivacySettings.PrivacyHeader" = "PRIVACY";
"PrivacySettings.BlockedUsers" = "Blocked Users";
"PrivacySettings.LastSeen" = "Last Seen";
"PrivacySettings.Groups" = "Groups";
"PrivacySettings.VoiceCalls" = "Voice Calls";
"PrivacySettings.SecurityHeader" = "SECURITY";
"PrivacySettings.Passcode" = "Passcode";
"PrivacySettings.ActiveSessions" = "Active Sessions";

"PrivacySettings.UseProxy" = "Use Proxy";
"PrivacySettings.ProxyHeader" = "CONNECTION TYPE";

"PrivacySettings.TwoStepVerification" = "Two-Step Verification";

"Telegram.PasscodeSettingsViewController" = "Passcode";
"Passcode.LogoutDescription" = "If you don't remember your passcode, you can [logout]()";





"Chat.Input.StartBot" = "Start";

"InlineModalAction.Title" = "Share bot content";
"InlineModalAction.Desc" = "Select a user or chat to share content via %@";



"ChatList.Context.Unmute" = "Unmute";
"ChatList.Context.Mute" = "Mute";
"ChatList.Context.ClearHistory" = "Clear History";
"ChatList.Context.Call" = "Call";
"ChatList.Context.DeleteChat" = "Delete Chat";
"ChatList.Context.DeleteAndExit" = "Delete And Exit";
"ChatList.Context.LeaveChannel" = "Leave Channel";
"ChatList.Context.LeaveGroup" = "Leave Group";
"ChatList.Context.ReturnGroup" = "Return Group";
"ChatList.Context.Pin" = "Pin";
"ChatList.Context.Unpin" = "Unpin";

"ChatList.SecretChat.Terminated" = "Secret chat cancelled";
"ChatList.SecretChat.Joined" = "%@ joined your secret chat.";
"ChatList.SecretChat.Created" = "%@ created a secret chat.";
"ChatList.SecretChat.ExKeys" = "Waiting to come online";

"ChatList.UnsupportedMessage" = "Message is not supported";
"Chat.Message.Unsupported" = "This message is not supported by your version of Telegram. Please update to the latest version from the AppStore or install it from https://macos.telegram.org";
"Text.Copy" = "Copy";


"Peer.Activity.User.TypingText" = "typing";
"Peer.Activity.User.SendingPhoto" = "sending photo";
"Peer.Activity.User.RecordingVideo" = "recording video";
"Peer.Activity.User.SendingVideo" = "sending video";
"Peer.Activity.User.RecordingAudio" = "recording voice";
"Peer.Activity.User.SendingFile" = "sending file";


"Peer.Activity.Chat.Multi.TypingText" = "%d are typing";
"Peer.Activity.Chat.Multi.SendingPhoto" = "%d are sending photo";
"Peer.Activity.Chat.Multi.RecordingVideo" = "%d are recording video";
"Peer.Activity.Chat.Multi.SendingVideo" = "%d are sending video";
"Peer.Activity.Chat.Multi.RecordingAudio" = "%d are recording voice";
"Peer.Activity.Chat.Multi.SendingAudio" = "%d are sending audio";
"Peer.Activity.Chat.Multi.SendingFile" = "%d are sending file";



"Peer.Media.SharedMediaEmptyList" = "Share photos and videos in this chat - or this paperclip stays unhappy.";
"Peer.Media.SharedFilesEmptyList" = "You can send and receive files of any type up to 1.5 GB each and access them anywhere.";
"Peer.Media.SharedLinksEmptyList" = "All links shared in this chat will appear here.";
"Peer.Media.SharedMusicEmptyList" = "All music shared in this chat will appear here.";

"SecretTimer.Off" = "Off";

"Timer.Seconds_countable" = "%d";
"Timer.Seconds_zero" = "%d seconds";
"Timer.Seconds_one" = "%d second";
"Timer.Seconds_two" = "%d seconds";
"Timer.Seconds_few" = "%d seconds";
"Timer.Seconds_many" = "%d seconds";
"Timer.Seconds_other" = "%d seconds";


"Timer.Days_countable" = "%d";
"Timer.Days_zero" = "%d days";
"Timer.Days_one" = "%d day";
"Timer.Days_two" = "%d days";
"Timer.Days_few" = "%d days";
"Timer.Days_many" = "%d days";
"Timer.Days_other" = "%d days";


"Timer.Minutes_countable" = "%d";
"Timer.Minutes_zero" = "%d minutes";
"Timer.Minutes_one" = "%d minute";
"Timer.Minutes_two" = "%d minutes";
"Timer.Minutes_few" = "%d minutes";
"Timer.Minutes_many" = "%d minutes";
"Timer.Minutes_other" = "%d minutes";

"Timer.Hours_countable" = "%d";
"Timer.Hours_zero" = "%d hours";
"Timer.Hours_one" = "%d hour";
"Timer.Hours_two" = "%d hours";
"Timer.Hours_few" = "%d hours";
"Timer.Hours_many" = "%d hours";
"Timer.Hours_other" = "%d hours";


"Timer.Weeks_countable" = "%d";
"Timer.Weeks_zero" = "%d weeks";
"Timer.Weeks_one" = "%d week";
"Timer.Weeks_two" = "%d weeks";
"Timer.Weeks_few" = "%d weeks";
"Timer.Weeks_many" = "%d weeks";
"Timer.Weeks_other" = "%d weeks";

"Timer.Months_countable" = "%d";
"Timer.Months_zero" = "%d months";
"Timer.Months_one" = "%d month";
"Timer.Months_two" = "%d months";
"Timer.Months_few" = "%d months";
"Timer.Months_many" = "%d months";
"Timer.Months_other" = "%d months";

"Timer.Years_countable" = "%d";
"Timer.Years_zero" = "%d years";
"Timer.Years_one" = "%d year";
"Timer.Years_two" = "%d years";
"Timer.Years_few" = "%d years";
"Timer.Years_many" = "%d years";
"Timer.Years_other" = "%d years";

"Timer.Forever" = "Forever";
"ChatList.Draft" = "Draft:";
"ChatList.You" = "You";

"Notification.LockedPreview" = "You have new message";
"JoinLink.Join" = "Join";

"Group.Unavailable" = "Sorry, this group does not seem to exist.";

"Chat.Title.self" = "Your Cloud storage";
"Separator.ShowMore" = "show more";
"Separator.ShowLess" = "show less";
"Separator.Clear" = "clear";
"Stickers.Recent" = "Recent";
"Account.Confirm.AskQuestion" = "Please note that Telegram Support is done by volunteers. We try to respond as quickly as possible, but it may take a while. \n\nPlease take a look at the Telegram FAQ: it has important troubleshooting tips and answers to most questions.";
"Account.Confirm.GoToFaq" = "Open FAQ";

"Chat.SecretChat.EmptyHeader" = "Secret chats:";
"Chat.SecretChat.1Feature" = " - Use end-to-end encryption";
"Chat.SecretChat.2Feature" = " - Leave no trace on our servers";
"Chat.SecretChat.3Feature" = " - Have a self-destruct timer";
"Chat.SecretChat.4Feature" = " - Do not allow forwarding";


"TextView.Transform.Bold" = "Make Bold";
"TextView.Transform.Italic" = "Make Italic";
"TextView.Transform.Code" = "Make Monospace";
"AccountsController.NewAccount" = "New Account";

"Account.Confirm.Logout" = "Log out?";
"Account.Confirm.LogoutText" = "Remember, logging out cancels all your Secret Chats.";

"Telegram.ConvertGroupViewController" = "Supergroup";

"Supergroup.Convert.Description" = "**In supergroups:**\n\n• New members can see the full message history\n• Deleted messages will disappear for all members\n• Admins can pin important messages\n• Creator can set a public link for the group";
"Supergroup.Convert.Undone" = "**Note**: This action cannot be undone.";
"Supergroup.Convert.Button" = "Convert to Supergroup";


"PeerInfo.MembersHeader_countable" = "%d";
"PeerInfo.MembersHeader_zero" = "%d MEMBERS";
"PeerInfo.MembersHeader_one" = "%d MEMBER";
"PeerInfo.MembersHeader_two" = "%d MEMBERS";
"PeerInfo.MembersHeader_few" = "%d MEMBERS";
"PeerInfo.MembersHeader_many" = "%d MEMBERS";
"PeerInfo.MembersHeader_other" = "%d MEMBERS";

"PeerInfo.InviteLink" = "Invite Link";
"PeerInfo.Admins" = "Admins";
"PeerInfo.BlackList" = "Blacklist";
"PeerInfo.SetAdmins" = "Set Admins";
"PeerInfo.GroupType" = "Group Type";
"PeerInfo.ChannelType" = "Channel Type";
"PeerInfo.GroupType.Public" = "Public";
"PeerInfo.GroupType.Private" = "Private";
"PeerInfo.SetAboutDescription" = "You can provide an optional description for your group.";
"PeerInfo.About.Placeholder" = "Description";
"PeerInfo.ConvertToSupergroup" = "Convert To Supergroup";

"Telegram.ChannelBlacklistViewController" = "Blacklist";
"Telegram.ChannelAdminsViewController" = "Admins";

"ChannelBlacklist.EmptyDescrpition" = "Blacklisted users are removed from the group and can only come back if invited by an admin. Invite links don't work for them.";

"Admins.GroupAdmins" = "GROUP ADMINS";
"Admins.ChannelAdmins" = "CHANNEL ADMINS";

"Admins.OnlyAdminsCanAddMembers" = "Only Admins can add new members";
"Admins.EverbodyCanAddMembers" = "Everybody can add new members";
"Admins.GroupDescription" = "You can add admins to help you manage your group";
"Admins.ChannelDescription" = "You can add admins to help you manage your channel";
"Admins.SelectNewAdminTitle" = "Contacts";
"Admins.AddAdmin" = "Add Admin";
"Admins.Creator" = "Creator";
"Admins.Admin" = "Admin";
"Admins.WhoCanInvite.Text" = "Who can add members";
"Admins.WhoCanInvite.Admins" = "Only Admins";
"Admins.WhoCanInvite.Everyone" = "All Members";

"Telegram.ChannelVisibilityController" = "Group";
"PeerInfo.Confirm.AddMembers" = "Add %d users to group?";
"PeerInfo.Confirm.AddMember" = "Add \"%@\" to group?";
"PeerInfo.Confirm.RemovePeer" = "Remove \"%@\" from group?";

"PeerInfo.FirstName.Placeholder" = "First Name";
"PeerInfo.LastName.Placeholder" = "Last Name";
"PeerInfo.GroupName.Placeholder" = "Group Name";
"PeerInfo.ChannelName.Placeholder" = "Channel Name";
"PeerInfo.Phone" = "phone";

"ConvertToSupergroup.Alert.Error" = "Something is wrong, please try again later.";
"ConvertToSuperGroup.Confirm" = "Are you sure? This action cannot be undone.";
"Telegram.LinkInvationController" = "Invite Link";

"GroupInvation.CopyLink" = "Copy Link";
"GroupInvation.Revoke" = "Revoke";
"GroupInvation.Share" = "Share Link";

"GroupInvation.GroupDescription" = "Anyone who has Telegram installed will be able to join your group by following this link";
"GroupInvation.ChannelDescription" = "Anyone who has Telegram installed will be able to join your channel by following this link";

"Chat.Header.PinnedMessage" = "Pinned message";
"Chat.Header.ReportSpam" = "Report Spam";
"Chat.Confirm.Unpin" = "Would you like to unpin this message?";

"StickerPack.Add" = "Add %d Stickers";
"Compose.Select.SecretChat" = "Secret Chat";
"Compose.Confirm.StartSecretChat" = "Create secret chat with \"%@\"";
"StickerPack.Remove" = "Remove %d stickers";

"ReportReason.Spam" = "Spam";
"ReportReason.Violence" = "Violence";
"ReportReason.Porno" = "Pornography";
"PeerInfo.ChannelReported" = "Thank You! Your report will be reviewed by our team very soon.";

"PeerInfo.SignMessages.Desc" = "Add names of the admins to the messages they post.";
"PeerInfo.SignMessages" = "Sign Messages";
"PeerInfo.SetChannelPhoto" = "Set Channel Photo";
"PeerInfo.Members" = "Members";
"PeerInfo.DeleteChannel" = "Delete Channel";
"PeerInfo.DeleteSecretChat" = "Delete Secret Chat";

"ChannelMembers.AddMembers" = "Add Members";
"ChannelMembers.InviteLink" = "Invite via Link";
"ChannelMembers.MembersListDesc" = "Only channel admins can see this list.";
"Telegram.ChannelMembersViewController" = "Channel Members";

"LinkInvation.Group.Confirm.Revoke" = "Are you sure you want to revoke this link? Once you do, no one will be able to join the group using it.";
"LinkInvation.Channel.Confirm.Revoke" = "Are you sure you want to revoke this link? Once you do, no one will be able to join the channel using it.";
"LinkInvation.Confirm.Ok" = "Revoke";
"ChannelMembers.Select.Title" = "Add Members";
"PeerInfo.Confirm.StartSecretChat" = "Are you sure you want to start a secret chat with \"%@\"?";


"PeerInfo.BotStatus.HasNoAccess" = "has no access to messages";
"PeerInfo.BotStatus.HasAccess" = "has access to messages";
"PeerInfo.GroupsInCommon" = "Groups In Common";
"GroupsInCommon.Empty" = "No groups in common";
"Telegram.GroupsInCommonViewController" = "Groups In Common";

"ChannelVisibility.Checking" = "Checking";
"ChannelVisibility.Loading" = "Loading...";
"Peer.DeletedUser" = "Deleted User";

"ChatList.Service.Call.incoming" = "Incoming Call (%@)";
"ChatList.Service.Call.outgoing" = "Outgoing Call (%@)";
"ChatList.Service.Call.Cancelled" = "Cancelled Call";

"ChatList.Service.Call.Missed" = "Missed Call";
"ChatList.Service.Call.Disconnected" = "Disconnected";

"ChatList.Service.GameScored" = "scored %d in %@";


"About.Description" = "Free messaging app for macOS based on MTProto for speed and security.";
"ChatService.ChannelCreated" = "channel created";
"Telegram.BlockedPeersViewController" = "Blocked Users";
"BlockedPeers.EmptyDescrpition" = "Blocked users can't send you messages or add you to groups. They will not see your profile pictures, online and last seen status.";

"Sessions.CurrentSessionHeader" = "CURRENT SESSION";
"Sessions.TerminateOthers" = "Terminate all other sessions";
"Sessions.TerminateDescription" = "Logs out all devices except for this one.";
"Sessions.ActiveSessionsHeader" = "ACTIVE SESSIONS";


"Passcode.TurnOn" = "Turn Passcode On";
"Passcode.TurnOnDescription" = "When you set up an additional passcode, you can use ⌘ + L for lock.\n\nNote: if you forget the passcode, you'll need to delete and reinstall the app. All secret chats will be lost.";
"Passcode.TurnOff" = "Turn Passcode Off";
"Passcode.Change" = "Change passcode";
"Passcode.Autolock" = "Auto-Lock";
"Passcode.AutoLock.Disabled" = "Disabled";
"Passcode.AutoLock.IfAway" = "If away for %@";

"Passcode.EnterPasscodePlaceholder" = "Enter a passcode";
"Passcode.ReEnterPlaceholder" = "Re-enter a passcode";
"Passcode.EnterCurrentPlaceholder" = "Enter Current Passcode";
"Passcode.EnterNewPlaceholder" = "Enter New Passcode";

"Passcode.Next" = "Next";


"Peer.ServiceNotifications" = "Service Notifications";

"Alert.SendError.Header" = "Your message could not be sent";
"Alert.SendError.Text" = "An error occurred while sending the previous message. Would you like to resend it ?";
"Alert.SendError.Resend" = "Resend";
"Alert.SendError.Delete" = "Delete";
"Alert.SendError.Ignore" = "Ignore";

"GeneralSettings.EnableSidebar" = "Sidebar";
"Telegram.RecentSessionsController" = "Active Sessions";
"RecentSessions.Confirm.TerminateOthers" = "Are you sure you want to terminate all other sessions?";
"RecentSessions.Confirm.Revoke" = "Do you want to terminate this session?";
"RecentSessions.Revoke" = "Revoke";

"Legacy.Intro.Description1" = "Welcome to the new super-fast and stable Telegram for macOS, fully rewritten in Swift 3.0.";
"Legacy.Intro.Description2" = "Please note that your existing secret chats will be available in read-only mode. You can of course create new ones to continue chatting.";
"Legacy.Intro.Next" = "Start Messaging";

"Messages.ReplyLoading.Header" = "Reply";
"Messages.ReplyLoading.Loading" = "Loading...";
"PeerInfo.DeleteContact" = "Delete Contact";
"PeerInfo.Confirm.DeleteContact" = "Delete Contact?";
"Compose.SelectUsers" = "Select users";
"PeerInfo.AddContact" = "Add Contact";
"Telegram.GroupAdminsController" = "Admins";
"GroupAdmins.AllMembersAdmins" = "All Members Are Admins";
"GroupAdmins.Desc.AdminInvites" = "Only admins can add and remove members, edit name and photo of this group.";
"GroupAdmins.Desc.AllInvites" = "Group members can add new members, edit name and photo of this group.";
"Login.PhoneNumberNotRegistred" = "Phone number not registered. If you don't have a Telegram account yet, please sign up with your mobile device.";
"Login.YourPhoneLabel" = "your phone";
"Login.YourCodeLabel" = "your code";
"Login.YourPasswordLabel" = "your password";

"PeerInfo.EncryptionKey" = "Encryption Key";

"Telegram.SecretChatKeyViewController" = "Encryption Key";
"EncryptionKey.Description" = "This image and text were derived from the encryption key for this secret chat with **%@**.\n\nIf they look the same on **%@**'s device, end-to-end encryption is guaranteed.";


"GeneralSettings.InAppSounds" = "In-App Sounds";
"Chat.ShareInlineResultActionHeader" = "Share";
"Context.CopyMedia" = "Save as...";
"Context.ShowInFinder" = "Show In Finder";
"Telegram.InstalledStickerPacksController" = "Stickers";
"Stickers.Set.Count" = "%d stickers";
"Telegram.FeaturedStickerPacksController" = "Trending Stickers";
"Telegram.ArchivedStickerPacksController" = "Archived Stickers";
"ArchivedStickers.Description" = "You can have up to 200 sticker sets installed. Unused stickers are archived when you add more.";
"InstalledStickers.PacksTitle" = "STICKER SETS";
"InstalledStickers.Descrpiption" = "Artists are welcome to add their own sticker sets using our @stickers bot.\n\nTap on a sticker to view and add the whole set.";
"InstalledStickers.Archived" = "Archived Stickers";
"InstalledStickers.Tranding" = "Trending Stickers";
"StickerSet.Remove" = "Remove";
"InstalledStickers.Remove.Description" = "Stickers will be archived, you can quickly restore it later from the Archived Stickers section.";
"InstalledStickers.Remove.Delete" = "Delete";
"Alert.UserDoesntExists" = "Sorry, this user doesn't seem to exist.";
"InAppLinks.Confirm.OpenExternal" = "open %@?";

"Login.Header.Code" = "Enter Code";
"Login.Header.Password" = "Enter Password";
"Login.Header.SignUp" = "Sign Up";
"Telegram.EmptyChatViewController" = "";
"Contacts.AddContact" = "Add Contact";
"Contacts.FirstName.Placeholder" = "First Name";
"Contacts.LastName.Placeholder" = "Last Name";
"Contacts.PhoneNumber.Placeholder" = "Phone Number";
"Contacts.NotRegistredTitle" = "Not Telegram Contact";
"Contacts.NotRegistredDescription" = "This contact is not registered in Telegram yet. You will be able to send them a Telegram message as soon as they sign up.";

"DataAndStorage.StorageUsage" = "Storage Usage";
"DataAndStorage.NetworkUsage" = "Network Usage";


"DataAndStorage.AutomaticDownload.GroupsChannels" = "Groups and Channels";

"DataAndStorage.AutomaticPhotoDownload.Header" = "AUTOMATIC PHOTO DOWNLOAD";
"DataAndStorage.AutomaticAudioDownload.Header" = "AUTOMATIC AUDIO DOWNLOAD";
"DataAndStorage.AutomaticVideoDownload.Header" = "AUTOMATIC VIDEO DOWNLOAD";



"Telegram.StorageUsageController" = "Storage Usage";
"StorageUsage.KeepMedia" = "Keep Media";
"StorageUsage.KeepMedia.Description" = "Photos, videos and other files from cloud chats that you have **not accessed** during this period will be removed from this device to save disk space.\n\nAll media will stay in the Telegram cloud and can be re-downloaded if you need it again.";
"StorageUsage.ChatsHeader" = "CHATS";
"StorageUsage.Calculating" = "Calculating current cache size...";
"App.MaxFileSize" = "Maximum file size is 1.5 GB";
"Message.Context.SaveGif" = "Add GIF";
"Context.RecentGifRemove" = "Remove";
"Sidebar.Avalability" = "Sidebar available in chat";


"PrivacySettingsController.Header" = "Last Seen";
"PrivacySettingsController.Everbody" = "Everybody";
"PrivacySettingsController.MyContacts" = "My Contacts";
"PrivacySettingsController.Nobody" = "Nobody";
"PrivacySettingsController.NeverShare" = "Never Share";
"PrivacySettingsController.AlwaysShare" = "Always Share";
"PrivacySettingsController.NeverShareWith" = "Never Share With";
"PrivacySettingsController.AlwaysShareWith" = "Always Share With";
"PrivacySettingsController.NeverAllow" = "Never Allow";
"PrivacySettingsController.AlwaysAllow" = "Always Allow";



"PrivacySettingsController.UserCount_countable" = "%d";
"PrivacySettingsController.UserCount_zero" = "%d user";
"PrivacySettingsController.UserCount_one" = "%d user";
"PrivacySettingsController.UserCount_two" = "%d users";
"PrivacySettingsController.UserCount_few" = "%d users";
"PrivacySettingsController.UserCount_many" = "%d users";
"PrivacySettingsController.UserCount_other" = "%d users";

"PrivacySettingsController.AddUsers" = "Add Users";

"PrivacySettingsController.LastSeenHeader" = "WHO CAN SEE MY TIMESTAMP";
"PrivacySettingsController.LastSeenDescription" = "Important: you won't be able to see Last Seen times for people with whom you don't share your Last Seen time. Approximate last seen will be shown instead (recently, within a week, within a month).";

"PrivacySettingsController.GroupHeader" = "WHO CAN ADD ME TO GROUP CHATS";
"PrivacySettingsController.GroupDescription" = "You can restrict who can add you to groups and channels with granular precision.";

"PrivacySettingsController.PhoneCallHeader" = "WHO CAN CALL ME";
"PrivacySettingsController.PhoneCallDescription" = "You can restrict who can call you with granular precision.";
"PrivacySettingsController.PeerInfo" = "These settings will override the values above.";

"Chat.Call.Outgoing" = "Outgoing Call";
"Chat.Call.Incoming" = "Incoming Call";

"CallHeader.EndCall" = "End Call";
"Call.ParticipantVersionOutdatedError" = "%@'s app does not support calls. They need to update their app before you can call them.";
"Call.UndefinedError" = "Undefined Error, please try later.";
"Call.PrivacyErrorMessage" = "Sorry, %@ doesn't accept calls.";

"Call.StatusRequesting" = "Contacting...";
"Call.StatusRinging" = "Ringing...";
"Call.StatusConnecting" = "Connecting...";
"Call.StatusEnded" = "Call Ended";
"Call.StatusFailed" = "Call Failed";
"Call.StatusBusy" = "Busy";
"Call.StatusCalling" = "is calling you...";



"Call.Recent.Outgoing" = "Outgoing";
"Call.Recent.Incoming" = "Incoming";
"Call.Recent.Missed" = "Missed";


"Call.ShortSeconds_countable" = "%d";
"Call.ShortSeconds_zero" = "%d sec";
"Call.ShortSeconds_one" = "%d sec";
"Call.ShortSeconds_two" = "%d sec";
"Call.ShortSeconds_few" = "%d sec";
"Call.ShortSeconds_many" = "%d sec";
"Call.ShortSeconds_other" = "%d sec";

"Call.ShortMinutes_countable" = "%d";
"Call.ShortMinutes_zero" = "%d min";
"Call.ShortMinutes_one" = "%d min";
"Call.ShortMinutes_two" = "%d min";
"Call.ShortMinutes_few" = "%d min";
"Call.ShortMinutes_many" = "%d min";
"Call.ShortMinutes_other" = "%d min";


"Telegram.LayoutRecentCallsViewController" = "Recent Calls";
"RecentCalls.Empty" = "Your recent calls will appear here";

"Call.Confirm.DiscardCurrent.Header" = "Call in Progress";
"Call.Confirm.DiscardCurrent.Description" = "Finish call with %@ and start a new one with %@?";
"Call.RatingModal.Placeholder" = "Leave comment...";
"QuickSwitcher.Recently" = "Recent";
"QuickSwitcher.Popular" = "Popular";
"QuickSwitcher.Description" = "**tab** or **↑ ↓** to navigate, **⮐** to select, **esc** to dismiss";

"Chat.Context.Edit1" = "Edit";
"Chat.Context.EditHelp" = "click on date";
"Chat.Context.EnableNotifications" = "Mute";
"Chat.Context.DisableNotifications" = "Unmute";
"Chat.Context.ClearHistory" = "Clear History";
"Chat.Context.Info" = "Info";


"Payments.Unsupported" = "Sorry, Telegram Mac doesn't support payments yet. Please use one of our mobile apps to do this.";

"Chat.Service.PaymentSent" = "You have just successfully transferred **%@** to **%@** for **%@**";
"Chat.List.Service.PaymentSent" = "Payment: %@";

"Telegram.LanguageViewController" = "Language";


"1Xt-HY-uBw.title" = "Telegram";

"2oI-Rn-ZJC.title" = "Transformations";

"4J7-dP-txa.title" = "Enter Full Screen";
"4sb-4s-VLi.title" = "Quit Telegram";
"5QF-Oa-p0T.title" = "Edit";
"_NS:88.title" = "Edit";
"5kV-Vb-QxS.title" = "About Telegram";
"6dh-zS-Vam.title" = "Redo";
"78Y-hA-62v.title" = "Correct Spelling Automatically";
"9ic-FL-obx.title" = "Substitutions";
"9yt-4B-nSM.title" = "Smart Copy/Paste";
"BOF-NM-1cW.title" = "Preferences…";
"Cag-YX-WT6.title" = "Hide Telegram";
"Dv1-io-Yv7.title" = "Spelling and Grammar";
"FeM-D8-WVr.title" = "Substitutions";
"H8h-7b-M4v.title" = "View";
"_NS:70.title" = "View";
"HFQ-gK-NFA.title" = "Text Replacement";
"HFo-cy-zxI.title" = "Show Spelling and Grammar";
"HyV-fh-RgO.title" = "View";
"Kd2-mp-pUS.title" = "Show All";
"LE2-aR-0XJ.title" = "Bring All to Front";
"OY7-WF-poV.title" = "Minimize";
"Olw-nP-bQN.title" = "Hide";
"QvC-M9-y7g.title" = "Telegram";
"R4o-n2-Eq4.title" = "Zoom";
"Ruw-6m-B2m.title" = "Select All";
"Td7-aD-5lo.title" = "Window";
"UEZ-Bs-lqG.title" = "Capitalize";
"Vdr-fp-XzO.title" = "Hide Others";
"W48-6f-4Dl.title" = "Edit";
"WeT-3V-zwk.title" = "Paste and Match Style";
"aUF-d1-5bR.title" = "Window";
"_NS:138.title" = "Window";
"c8a-y6-VQd.title" = "Transformations";
"cwL-P1-jid.title" = "Smart Links";
"d9M-CD-aMd.title" = "Make Lower Case";
"dRJ-4n-Yzg.title" = "Undo";
"gVA-U4-sdL.title" = "Paste";
"hQb-2v-fYv.title" = "Smart Quotes";
"hz2-CU-CR7.title" = "Check Document Now";
"mK6-2p-4JG.title" = "Check Grammar With Spelling";
"pa3-QI-u2k.title" = "Delete";
"rbD-Rh-wIN.title" = "Check Spelling While Typing";
"rgM-f4-ycn.title" = "Smart Dashes";
"tRr-pd-1PS.title" = "Data Detectors";
"uQy-DD-JDr.title" = "Telegram";
"uRl-iY-unG.title" = "Cut";
"vmV-6d-7jI.title" = "Make Upper Case";
"x3v-GG-iWU.title" = "Copy";
"1000.title" = "Check for Updates";
"z6F-FW-3nz.title" = "Show Substitutions";
"sZh-ct-GQS.title" = "Quick Search";

"Login.ContinueOnLanguage" = "Continue on English";
"Date.Today" = "Today";

/* This key for which language this file, for example: Italian -> Italiano, Russian -> Русский */
"AccountSettings.CurrentLanguage" = "English";
"Suggest.Localization.Header" = "Choose your language";
"Suggest.Localization.Other" = "Other";

"PrivacySettings.PeerSelect.AddNew" = "Add New";

"Channel.EditAdmin.Permission.ChangeInfo" = "Change Channel Info";
"Group.EditAdmin.Permission.ChangeInfo" = "Change Group Info";
"Channel.EditAdmin.Permission.DeleteMessages" = "Delete Messages";
"Channel.EditAdmin.Permission.BanUsers" = "Ban Users";
"Channel.EditAdmin.Permission.PinMessages" = "Pin Messages";
"Channel.EditAdmin.Permission.AddNewAdmins" = "Add New Admins";
"Channel.EditAdmin.Permission.PostMessages" = "Post Messages";
"Channel.EditAdmin.Permission.EditMessages" = "Edit Messages";
"Channel.EditAdmin.Permission.InviteUsers" = "Invite Users";

"Channel.Persmission.Denied.SendMessages.Until" = "The admins of this group have restricted you from writing here until %@";
"Channel.Persmission.Denied.SendMessages.Forever" = "The admins of this group have restricted you from writing here";

"Channel.Persmission.Denied.SendMedia.Until" = "The admins of this group have restricted you from sending media here until %@";
"Channel.Persmission.Denied.SendMedia.Forever" = "The admins of this group have restricted you from sending media here";

"Channel.Persmission.Denied.SendStickers.Until" = "The admins of this group have restricted you from sending stickers here until %@";
"Channel.Persmission.Denied.SendStickers.Forever" = "The admins of this group have restricted you from sending stickers here";

"Channel.Persmission.Denied.SendInline.Until" = "The admins of this group have restricted you from posting inline content here until %@";
"Channel.Persmission.Denied.SendInline.Forever" = "The admins of this group have restricted you from posting inline content here";

"Channel.Admin.Dismiss" = "Dismiss Admin";
"Channel.Admin.AdminAccess" = "This Admin will be able to add new admins with the same (or more limited) permissions than he/she has.";
"Channel.Admin.AdminRestricted" = "This admin will not be able to add new admins.";

"Channel.Admin.WhatCanAdminDo" = "WHAT CAN THIS ADMIN DO?";

"Channel.EventLog.What" = "What Is This?";
"Channel.EventLog.Alert.Header" = "What is an event log?";
"Channel.EventLog.Alert.Info" = "This is a list of all service actions taken by the group's members and admins in the last 48 hours.";


"Group.EventLog.Service.TitleUpdated" = "%@ edited group title:";
"Group.EventLog.Service.LinkUpdated" = "%@ edited group link:";
"Group.EventLog.Service.AboutUpdated" = "%@ edited group description:";

"Channel.EventLog.Service.TitleUpdated" = "%@ edited channel title:";
"Channel.EventLog.Service.LinkUpdated" = "%@ edited channel link:";
"Channel.EventLog.Service.AboutUpdated" = "%@ edited channel description:";

"Group.EventLog.Service.LinkRemoved" = "%@ removed group link:";
"Group.EventLog.Service.AboutRemoved" = "%@ removed group description:";
"Channel.EventLog.Service.LinkRemoved" = "%@ removed channel link:";
"Channel.EventLog.Service.AboutRemoved" = "%@ removed channel description:";

"EventLog.Service.PreviousTitle" = "Previous Title";
"EventLog.Service.PreviousLink" = "Previous Link";
"EventLog.Service.PreviousDesc" = "Previous Description";


"EventLog.Service.Demote.SendMessages" = "Send Messages";
"EventLog.Service.Demote.SendMedia" = "Send Media";
"EventLog.Service.Demote.SendStickers" = "Send Stickers";
"EventLog.Service.Demote.EmbedLinks" = "Embed Links";
"EventLog.Service.Demote.SendInline" = "Send Inline";

"EventLog.Service.Promote.ChangeInfo" = "Change Info";
"EventLog.Service.Promote.DeleteMessages" = "Delete Messages";
"EventLog.Service.Promote.PostMessages" = "Post Messages";
"EventLog.Service.Promote.AddUsers" = "Add Users";
"EventLog.Service.Promote.InviteViaLink" = "Invite Users Via Link";
"EventLog.Service.Promote.PinMessages" = "Pin Messages";
"EventLog.Service.Promote.AddNewAdmins" = "Add New Admins";
"EventLog.Service.Promote.BanUsers" = "Ban Users";
"EventLog.Service.Promote.EditMessages" = "Edit Messages";

"EventLog.Service.Promoted.Changed" = "changed privileges for %@ %@:";
"EventLog.Service.Promoted" = "promoted %@ %@:";

"EventLog.Service.Demoted" = "restricted %@ %@ indefinitely";
"EventLog.Service.Demoted.Until" = "restricted %@ %@ until %@";
"EventLog.Service.Demoted.Changed" = "changed restrictions for %@ %@ indefinitely";
"EventLog.Service.Demoted.Changed.Until" = "changed restrictions for %@ %@ until %@";
"EventLog.Service.Banned" = "Banned %@ %@";

"EventLog.Service.DeletedMessage" = "%@ deleted message:";
"EventLog.Service.EditedMessage" = "%@ edited message:";
"EventLog.Service.UpdatePinned" = "%@ pinned message:";
"EventLog.Service.RemovePinned" = "%@ unpinned message";
"EventLog.Service.ChangedStickerSet" = "%@ changed group sticker set";
"EventLog.Service.RemovedStickerSet" = "%@ removed group sticker set";


"Group.EventLog.Service.EnableInvites" = "%@ enabled group invites";
"Group.EventLog.Service.DisableInvites" = "%@ disabled group invites";
"Channel.EventLog.Service.EnableSignatures" = "%@ enabled channel signatures";
"Channel.EventLog.Service.DisableSignatures" = "%@ disabled channel signatures";


"Group.EventLog.Service.PhotoUpdated" = "%@ updated group photo";
"Group.EventLog.Service.PhotoRemoved" = "%@ removed group photo";
"Channel.EventLog.Service.PhotoUpdated" = "%@ updated channel photo";
"Channel.EventLog.Service.PhotoRemoved" = "%@ removed channel photo";

"Group.EventLog.Service.UpdateLeft" = "%@ left the group";
"Channel.EventLog.Service.UpdateLeft" = "%@ left the channel";

"Group.EventLog.Service.UpdateJoin" = "%@ joined the group";
"Channel.EventLog.Service.UpdateJoin" = "%@ joined the channel";


"Telegram.ChannelEventLogController" = "All Actions";

"ChannelEventFilter.NewRestrictions" = "New Restrictions";
"ChannelEventFilter.NewAdmins" = "New Admins";
"ChannelEventFilter.NewMembers" = "New Members";
"ChannelEventFilter.GroupInfo" = "Group Info";
"ChannelEventFilter.ChannelInfo" = "Channel Info";
"ChannelEventFilter.DeletedMessages" = "Deleted Messages";
"ChannelEventFilter.EditedMessages" = "Edited Messages";
"ChannelEventFilter.PinnedMessages" = "Pinned Messages";
"ChannelEventFilter.LeavingMembers" = "Members Removed";

"Group.EventLog.EmptyText" = "**No events here yet**\n\nThere were no service actions taken by the group's members and admins for the last 48 hours.";
"Channel.EventLog.EmptyText" = "**No events here yet**\n\nThere were no service actions taken by the channel's members and admins for the last 48 hours.";
"Channel.EventLog.EmptySearch" = "** No events found**\n\nNo recent events that match your query have been found.";

"ChannelBlacklist.Restricted" = "RESTRICTED";
"ChannelBlacklist.Blocked" = "BLOCKED";
"ChannelBlacklist.AddMember" = "Add Member";

"Channel.UserRestriction" = "USER RESTRICTIONS";
"Channel.BlockUser.CanReadMessages" = "Can Read Messages";
"Channel.BlockUser.CanSendMessages" = "Can Send Messages";
"Channel.BlockUser.CanSendMedia" = "Can Send Media";
"Channel.BlockUser.CanSendStickers" = "Can Send Stickers & GIFs";
"Channel.BlockUser.CanEmbedLinks" = "Can Embed Links";
"Channel.BlockUser.BlockFor" = "Block For";
"Channel.Blacklist.SelectNewUserTitle" = "Members";

"Channel.Admins.PromotedBy" = "promoted by %@";
"Channel.Admins.AddAdminError" = "Sorry you can't promote this user to admin";
"Channel.Blacklist.RestrictedBy" = "restricted by %@";
"Channel.Blacklist.BlockedBy" = "blocked by %@";
"Channel.Blacklist.DemoteAdminError" = "Sorry, you can't ban this user because they are an admin in this group and you are not allowed to demote them.";

"Channel.Admins.Promote.BannedAdminError" = "Sorry, you can't add this user as an admin because they are in the blacklist and you can't unban them.";
"Channel.Admins.Promote.UnmemberAdminError" = "Sorry, you can't add this user as an admin because they are not a member of this group and you are not allowed to invite them.";
"Channel.BanForever" = "Forever";

"Channel.EventFilter.EventsHeader" = "EVENTS";
"Channel.EventFilter.AdminsHeader" = "ADMINS";

"Channel.SelectPeers.Contacts" = "contacts";
"Channel.SelectPeers.Global" = "global";

"Supergroup.DeleteRestriction.DeleteMessage" = "Delete Message";
"Supergroup.DeleteRestriction.BanUser" = "Ban User";
"Supergroup.DeleteRestriction.ReportSpam" = "Report Spam";
"Supergroup.DeleteRestriction.DeleteAllMessages" = "Delete All Messages";
"ChannelAdmins.RecentActions" = "Recent Actions";


"Telegram.ProxySettingsViewController" = "Proxy";
"ProxySettings.ConnectionHeader" = "Connection";
"ProxySettings.CredentialsHeader" = "CREDENTIALS (OPTIONAL)";
"ProxySettings.Disabled" = "Disabled";
"ProxySettings.Socks5" = "SOCKS5";
"ProxySettings.Server" = "Server";
"ProxySettings.Port" = "Port";
"ProxySettings.Username" = "Username";
"ProxySettings.Password" = "Password";
"ProxySettings.Save" = "Save";

"Channel.EventLog.OriginalMessage" = "Original message";
"Channel.EventLog.Empty" = "Empty";
"Channel.Admin.CantEditRights" = "You cannot edit the rights of this admin.";
"Channel.Blacklist.Unban" = "Unban";

"ConnectingStatus.DisableProxy" = "click here to disable proxy";
"Proxy.ForceDisable" = "Are you sure you want to disable proxy server %@?";
"Proxy.ForceEnable.Header" = "Are you sure you want to enable this proxy?";
"Proxy.ForceEnable.Text.IP" = "Server: %@";
"Proxy.ForceEnable.Text.Port" = "Port: %d";
"Proxy.ForceEnable.Text.Username" = "Username: %@";
"Proxy.ForceEnable.Text.Password" = "Password: %@";
"Proxy.ForceEnable.Text" = "You can change your proxy server later in the Settings (Privacy and Security).";
"ProxySettings.Share" = "Share this link with friends to circumvent censorship in your country";
"ProxySettings.ExportLink" = "Export link from clipboard";
"ProxySettings.ProxyNotFound" = "Proxy settings not found in clipboard.";
"ProxySettings.ExportDescription" = "If your clipboard contains socks5-link (**t.me/socks?server=127.0.0.1&port=80**) it will apply immediately";
"Confirm.AddBotToGroup" = "Add the bot to \"%@\"?";

"AccountSettings.Appearance" = "Appearance";
"Telegram.AppearanceViewController" = "Appearance";
"Telegram.SelectPeersController" = "Select Users";
"GeneralSettings.DarkMode" = "Dark Mode";
"GeneralSettings.DarkMode.Description" = "A color scheme for nighttime and dark desktops";
"GeneralSettings.Font.Description" = "Use large font for messages";
"Telegram.MainViewController" = "";

"MessageContext.CopyMessageLink" = "Copy Link";
"Context.ViewStickerSet" = "View Sticker Set";

"Storage.Clear.Photos" = "Photos";
"Storage.Clear.Videos" = "Videos";
"Storage.Clear.Audio" = "Audio";
"Storage.Clear.Documents" = "Documents";
"Storage.Clear" = "Clear %@";
"AccountSettings.Bio" = "Bio";

"Telegram.BioViewController" = "Bio";

"Bio.Placeholder" = "A few words about you";
"Bio.Description" = "Any details such as age, occupation of city. Example: 23 y.o. designer from San Francisco";
"Bio.Save" = "Save";

"ServiceMessage.ExpiredPhoto" = "photo has expired";
"ServiceMessage.ExpiredFile" = "file has expired";
"ServiceMessage.ExpiredVideo" = "video has expired";

"ServiceMessage.DesturctingPhoto" = "%@ sent you a self-destructing photo. Please view it on your mobile.";
"ServiceMessage.DesturctingPhoto.You" = "%@ sent a self-destructing photo.";

"ServiceMessage.DesturctingVideo" = "%@ sent you a self-destructing video. Please view it on your mobile.";
"ServiceMessage.DesturctingVideo.You" = "%@ sent a self-destructing video.";
"ChatList.Service.DestructingPhoto" = "self-destructing photo";
"ChatList.Service.DestructingVideo" = "self-destructing video";


"ShareExtension.Share" = "Share";
"ShareExtension.Cancel" = "Cancel";
"ShareExtension.Search" = "Search";
"ShareExtension.Passcode.Placeholder" = "passcode";
"ShareExtension.Passcode.Next" = "Next";
"ShareExtension.Unauthorized.OK" = "OK";
"ShareExtension.Unauthorized.Description" = "To share via Telegram, please open the Telegam app and log in.";

"Chat.SearchFrom" = "from:";
"Chat.SearchCount" = "%d of %d";

"Entertainment.Emoji" = "EMOJI";
"Entertainment.Stickers" = "STICKERS";
"Entertainment.GIF" = "GIFs";
"ShareModal.Search.Placeholder" = "Share to...";
"InstantPage.AuthorAndDateTitle" = "By %1$@ • %2$@";
"IV.Channel.Join" = "Join";

"Chat.Context.AddFavoriteSticker" = "Add to Favorites";
"Chat.Context.RemoveFavoriteSticker" = "Remove from Favorites";
"Chat.InstantView" = "INSTANT VIEW";
"Context.RemoveFaveSticker" = "Remove";
"Stickers.GroupStickers" = "GROUP STICKERS";

"PeerInfo.SetGroupStickersSet" = "Group Sticker Set";
"Telegram.GroupStickerSetController" = "Group Sticker Set";
"GroupStickers.CreateDescription" = "You can create your own custom sticker set using @stickers bot.";
"GroupStickers.ChooseHeader" = "CHOOSE FROM YOUR STICKERS";
"GroupStickers.EmptyHeader" = "No such sticker set found";
"GroupStickers.EmptyDesc" = "Try again or choose from list below";

"AccountSettings.SetBio" = "Set a Bio";
"AccountSettings.SetUsername" = "Set a Username";

"FastSettings.EnableDarkMode" = "Enable Dark Mode";
"FastSettings.DisableDarkMode" = "Disable Dark Mode";
"FastSettings.LockTelegram" = "Lock Telegram";
"FastSettings.Mute2Hours" = "Mute For 2 Hours";
"FastSettings.Unmute" = "Unmute";
"FastSettings.SetPasscode" = "Set a Passcode";

"GeneralSettings.AppearanceSettings" = "APPEARANCE SETTINGS";

"Chat.Context.CopyBlock" = "Copy Preformatted Block";

"Compose.SelectGroupUsers.Placeholder" = "Whom would you like to message?";

"PeerInfo.PreHistory" = "Chat History For New Members";
"PeerInfo.PreHistory.Visible" = "Visible";
"PeerInfo.PreHistory.Hidden" = "Hidden";
"Telegram.PreHistorySettingsController" = "Chat History Settings";

"PreHistorySettings.Header" = "CHAT HISTORY FOR NEW MEMBERS";
"PreHistorySettings.Description.Visible" = "New Members will see messages that were sent before they joined.";
"PreHistorySettings.Description.Hidden" = "New members won't see earlier messages.";
"Chat.AdminBadge" = "admin";

"ChangePhoneNumber.Intro.Description" = "You can change your Telegram number here. Your account and all your cloud data — messages, media, contacts, etc. will be moved to the new number.\n\n**Important**: all your Telegram contacts will get your **new number** added to their address book, provided they had your old number and you haven't blocked them in Telegram.";
"ChangePhoneNumber.Intro.Alert" = "All your Telegram contacts will get your new number added to their address book, provided they had your old number and you haven't blocked them in Telegram.";
"Telegram.PhoneNumberIntroController" = "Change Phone Number";
"Telegram.PhoneNumberConfirmController" = "Change Number";

"ChangeNumber.SendData.Error.LimitExceeded" = "You have requested authorization code too many times. Please try again later.";
"ChangeNumber.SendData.Error.InvalidPhoneNumber" = "The phone number you entered is not valid. Please enter the correct number along with your area code.";
"ChangeNumber.SendData.Error.PhoneNumberOccupied" = "The number %@ is already connected to a Telegram account. Please delete that account before migrating to the new number.";
"ChangeNumber.SendData.Error.Generic" = "An error occurred. Please try again later.";


"ChangeNumber.ConfirmCode.Error.Generic" = "An error occurred.";
"ChangeNumber.ConfirmCode.Error.invalidCode" = "Invalid code. Please try again.";
"ChangeNumber.ConfirmCode.Error.codeExpired" = "Code expired.";
"ChangeNumber.ConfirmCode.Error.limitExceeded" = "You have entered invalid code too many times. Please try again later.";
"ChangeNumber.ConfirmCode.Success" = "You have changed your phone number to %@.";
"Messages.Placeholder.Broadcast" = "Broadcast...";


"GeneralSettings.ForceTouchHeader" = "FORCE TOUCH ACTION";
"GeneralSettings.ForceTouch.Reply" = "Reply to Message";
"GeneralSettings.ForceTouch.Edit" = "Edit Message";
"GeneralSettings.ForceTouch.Forward" = "Forward Message";


"ChatMessage.Tooltip.Views" = "views";


"Telegram.TwoStepVerificationUnlockController" = "Two-Step Verification";

"TwoStepAuth.PasswordTitle" = "Password";

"TwoStepAuth.SetPassword" = "Set Additional Password";
"TwoStepAuth.SetPasswordHelp" = "You can set a password that will be required when you log in on a new device in addition to the code you get in the SMS.";

"TwoStepAuth.SetupPasswordTitle" = "Your Password";
"TwoStepAuth.SetupHintTitle" = "Password Hint";
"TwoStepAuth.SetupEmailTitle" = "Recovery E-Mail";


"TwoStepAuth.SetupHint" = "Please create a hint for your password";

"TwoStepAuth.ChangePassword" = "Change Password";
"TwoStepAuth.RemovePassword" = "Turn Password Off";
"TwoStepAuth.SetupEmail" = "Set Recovery E-Mail";
"TwoStepAuth.ChangeEmail" = "Change Recovery E-Mail";
"TwoStepAuth.PendingEmailHelp" = "Your recovery e-mail %@ is not yet active and pending confirmation.";
"TwoStepAuth.GenericHelp" = "You have enabled Two-Step verification.\nYou'll need the password you set up here to log in to your Telegram account.";

"TwoStepAuth.ConfirmationText" = "Please check your e-mail and click on the validation link to complete Two-Step Verification setup. Be sure to check the spam folder as well.";
"TwoStepAuth.ConfirmationAbort" = "Abort Two-Step Verification Setup";

"TwoStepAuth.SetupPasswordEnterPassword" = "Enter a password";
"TwoStepAuth.SetupPasswordEnterPasswordNew" = "Please enter your new password";
"TwoStepAuth.SetupPasswordConfirmPassword" = "Please re-enter your password";
"TwoStepAuth.SetupPasswordConfirmFailed" = "Passwords don't match. Please try again.";

"TwoStepAuth.EnterPasswordPassword" = "Password";
"TwoStepAuth.EnterPasswordHint" = "Hint: %@";
"TwoStepAuth.EnterPasswordHelp" = "You have enabled Two-Step Verification, so your account is protected with an additional password.";
"TwoStepAuth.EnterPasswordForgot" = "Forgot password?";

"TwoStep.AuthEmailSkip" = "Skip";

"TwoStepAuth.EmailSkipAlert" = "No, seriously.\n\nIf you forget your password, you will lose access to your Telegram account. There will be no way to restore it.";
"TwoStepAuth.Email" = "E-Mail";
"TwoStepAuth.EmailHelp" = "Please add your valid e-mail. It is the only way to recover a forgotten password.";
"TwoStepAuth.EmailInvalid" = "Invalid e-mail address. Please try again.";
"TwoStepAuth.EmailSent" = "We have sent you an e-mail to confirm your address.";

"TwoStepAuth.RecoveryUnavailable" = "Since you haven't provided a recovery e-mail when setting up your password, your remaining options are either to remember your password or to reset your account.";
"TwoStepAuth.RecoveryFailed" = "Your remaining options are either to remember your password or to reset your account.";

"TwoStepAuth.RecoveryTitle" = "E-Mail Code";
"TwoStepAuth.RecoverySent" = "We have sent a recovery code to the e-mail you provided:\n\n%@";
"TwoStepAuth.RecoveryCode" = "Code";
"TwoStepAuth.RecoveryCodeHelp" = "Please check your e-mail and enter the 6-digit code we've sent there to deactivate your cloud password.";
"TwoStepAuth.RecoveryCodeInvalid" = "Invalid code. Please try again.";
"TwoStepAuth.RecoveryCodeExpired" = "Code Expired";
"TwoStepAuth.RecoveryEmailUnavailable" = "Having trouble accessing your e-mail %@?";

"TwoStepAuth.FloodError" = "Limit exceeded. Please try again later.";
"TwoStepAuth.GenericError" = "An error occurred. Please try again later.";

"TwoStepAuth.AnError" = "An error occured. Please try again later.";
"TwoStepAuth.Error.HaventEmail" = "Since you haven't provided a recovery e-mail when setting up your password, your remaining options are either to remember your password or to reset your account.";
"TwoStepAuth.Error.LimitExceeded" = "You have entered invalid password too many times. Please try again later.";
"TwoStepAuth.Error.Generic" = "An error occured. Please try again later.";
"TwoStepAuth.Confirm.DisablePassword" = "Are you sure you want to disable your password?";
"TwoStepAuth.Error.InvalidEmail" = "Please enter valid e-mail address.";
"TwoStepAuth.Error.PasswordsDontMatch" = "Passwords don't match.\nPlease try again.";


"PreviewSender.SendFile_countable" = "%d";
"PreviewSender.SendFile_zero" = "Send File";
"PreviewSender.SendFile_one" = "Send File";
"PreviewSender.SendFile_two" = "Send %d Files";
"PreviewSender.SendFile_few" = "Send %d Files";
"PreviewSender.SendFile_many" = "Send %d Files";
"PreviewSender.SendFile_other" = "Send %d Files";

"PreviewSender.SendMedia_countable" = "%d";
"PreviewSender.SendMedia_zero" = "Send Media";
"PreviewSender.SendMedia_one" = "Send Media";
"PreviewSender.SendMedia_two" = "Send %d Media";
"PreviewSender.SendMedia_few" = "Send %d Media";
"PreviewSender.SendMedia_many" = "Send %d Media";
"PreviewSender.SendMedia_other" = "Send %d Media";

"PreviewSender.SendPhoto_countable" = "%d";
"PreviewSender.SendPhoto_zero" = "Send Photo";
"PreviewSender.SendPhoto_one" = "Send Photo";
"PreviewSender.SendPhoto_two" = "Send %d Photos";
"PreviewSender.SendPhoto_few" = "Send %d Photos";
"PreviewSender.SendPhoto_many" = "Send %d Photos";
"PreviewSender.SendPhoto_other" = "Send %d Photos";

"PreviewSender.SendVideo_countable" = "%d";
"PreviewSender.SendVideo_zero" = "Send Video";
"PreviewSender.SendVideo_one" = "Send Video";
"PreviewSender.SendVideo_two" = "Send %d Videos";
"PreviewSender.SendVideo_few" = "Send %d Videos";
"PreviewSender.SendVideo_many" = "Send %d Videos";
"PreviewSender.SendVideo_other" = "Send %d Videos";

"PreviewSender.SendGif_countable" = "%d";
"PreviewSender.SendGif_zero" = "Send GIF";
"PreviewSender.SendGif_one" = "Send GIF";
"PreviewSender.SendGif_two" = "Send %d GIFs";
"PreviewSender.SendGif_few" = "Send %d GIFs";
"PreviewSender.SendGif_many" = "Send %d GIFs";
"PreviewSender.SendGif_other" = "Send %d GIFs";

"PreviewSender.SendAudio_countable" = "%d";
"PreviewSender.SendAudio_zero" = "Send Audio";
"PreviewSender.SendAudio_one" = "Send Audio";
"PreviewSender.SendAudio_two" = "Send %d Audios";
"PreviewSender.SendAudio_few" = "Send %d Audios";
"PreviewSender.SendAudio_many" = "Send %d Audios";
"PreviewSender.SendAudio_other" = "Send %d Audios";


"Peer.SavedMessages" = "Saved Messages";



"PrivacySettings.LastSeenEverybodyMinus" = "Everybody (-%@)";
"PrivacySettings.LastSeenContactsPlus" = "My Contacts (+%@)";
"PrivacySettings.LastSeenContactsMinus" = "My Contacts (-%@)";
"PrivacySettings.LastSeenContactsMinusPlus" = "My Contacts (-%@, +%@)";
"PrivacySettings.LastSeenNobodyPlus" = "Nobody (+%@)";

"PrivacySettings.DeleteAccountHeader" = "DELETE ACCOUNT";
"PrivacySettings.DeleteAccountDescription" = "If you do not log in at least once within this period, your account will be deleted along with all groups, messages and contacts.";
"PrivacySettings.DeleteAccount" = "If Away For";
